## Employee-Satisfaction-Index

In [1]:
#Import Packages
import pandas as pd
import missingno as msno

In [2]:
esi = pd.read_csv("../Data/Employee-Satisfaction-Index.csv")

In [3]:
esi.head()

,Unnamed: 0,emp_id,age,Dept,location,education,recruitment_type,job_level,rating,onsite,awards,certifications,salary,satisfied
0,0,HR8270,28,HR,Suburb,PG,Referral,5,2,0,1,0,86750,1
1,1,TECH1860,50,Technology,Suburb,PG,Walk-in,3,5,1,2,1,42419,0
2,2,TECH6390,43,Technology,Suburb,UG,Referral,4,1,0,2,0,65715,0
3,3,SAL6191,44,Sales,City,PG,On-Campus,2,3,1,0,0,29805,1
4,4,HR6734,33,HR,City,UG,Recruitment Agency,2,1,0,5,0,29805,1

In [4]:
esi2 = esi.drop(columns=['emp_id', 'Unnamed: 0'])

In [5]:
esi2

,age,Dept,location,education,recruitment_type,job_level,rating,onsite,awards,certifications,salary,satisfied
0,28,HR,Suburb,PG,Referral,5,2,0,1,0,86750,1
1,50,Technology,Suburb,PG,Walk-in,3,5,1,2,1,42419,0
2,43,Technology,Suburb,UG,Referral,4,1,0,2,0,65715,0
3,44,Sales,City,PG,On-Campus,2,3,1,0,0,29805,1
4,33,HR,City,UG,Recruitment Agency,2,1,0,5,0,29805,1
...,...,...,...,...,...,...,...,...,...,...,...,...
495,49,HR,Suburb,PG,On-Campus,2,5,0,6,0,29805,1
496,24,Technology,Suburb,UG,Referral,2,4,0,2,0,29805,0
497,34,Marketing,City,PG,On-Campus,1,3,0,2,0,24076,1
498,26,Technology,City,UG,On-Campus,2,1,1,1,1,29805,0
499,26,Technology,City,UG,Recruitment Agency,3,4,0,3,0,42419,0

In [6]:
esi2.info

<bound method DataFrame.info of      age        Dept location education    recruitment_type  job_level  \
0     28          HR   Suburb        PG            Referral          5
1     50  Technology   Suburb        PG             Walk-in          3
2     43  Technology   Suburb        UG            Referral          4
3     44       Sales     City        PG           On-Campus          2
4     33          HR     City        UG  Recruitment Agency          2
..   ...         ...      ...       ...                 ...        ...
495   49          HR   Suburb        PG           On-Campus          2
496   24  Technology   Suburb        UG            Referral          2
497   34   Marketing     City        PG           On-Campus          1
498   26  Technology     City        UG           On-Campus          2
499   26  Technology     City        UG  Recruitment Agency          3

     rating  onsite  awards  certifications  salary  satisfied
0         2       0       1               0   86750          1
1         5       1       2               1   42419          0
2         1       0       2               0   65715          0
3         3       1       0               0   29805          1
4         1       0       5               0   29805          1
..      ...     ...     ...             ...     ...        ...
495       5       0       6               0   29805          1
496       4       0       2               0   29805          0
497       3       0       2               0   24076          1
498       1       1       1               1   29805          0
499       4       0       3               0   42419          0

[500 rows x 12 columns]>

In [11]:
esi['Dept'].unique()

array(['HR', 'Technology', 'Sales', 'Purchasing', 'Marketing'],
      dtype=object)

In [17]:
esi2['education'].replace(['PG', 'UG'],
                        [0,1], inplace=True)

In [21]:
esi2['Dept'].replace(['HR', 'Technology', 'Marketing', 'Sales', 'Purchasing'],
                     [0,1,2,3,4], inplace=True)

In [24]:
esi2['location'].replace(['Suburb', 'City'],
                      [0,1], inplace=True)

In [27]:
esi2['recruitment_type'].replace(['Referral', 'Walk-in', 'On-Campus', 'Recruitment Agency'],
                                [0,1,2,3], inplace=True)

In [28]:
esi2

,age,Dept,location,education,recruitment_type,job_level,rating,onsite,awards,certifications,salary,satisfied
0,28,0,0,0,0,5,2,0,1,0,86750,1
1,50,1,0,0,1,3,5,1,2,1,42419,0
2,43,1,0,1,0,4,1,0,2,0,65715,0
3,44,3,1,0,2,2,3,1,0,0,29805,1
4,33,0,1,1,3,2,1,0,5,0,29805,1
...,...,...,...,...,...,...,...,...,...,...,...,...
495,49,0,0,0,2,2,5,0,6,0,29805,1
496,24,1,0,1,0,2,4,0,2,0,29805,0
497,34,2,1,0,2,1,3,0,2,0,24076,1
498,26,1,1,1,2,2,1,1,1,1,29805,0
499,26,1,1,1,3,3,4,0,3,0,42419,0